import {
  Flex,
  Box,
  Text,
  Tabs,
  Tab,
  TabPanel,
  TabPanels,
  TabIndicator,
  TabList,
} from "@chakra-ui/react";

import Layout from "../components/layout";
import Header from "../components/header";
import Footer from "../components/footer";
import ProdTabInfo from "../components/prodtabinfo";

import x500Euro5 from "../assets/moto/500xeuro5.png";
import x500singleswingarm from "../assets/moto/500xsingleswingarm.png";
import x500 from "../assets/moto/500x.png";
import f500 from "../assets/moto/500f.png";
import f400scrambler from "../assets/moto/400fscrambler.png";
import f321 from "../assets/moto/321f.png";
import rally450 from "../assets/moto/450rally.png";
import rally450low from "../assets/moto/450rallylow.png";
import r310 from "../assets/moto/310r.png";
import rr321 from "../assets/moto/321rr.png";
import rr400 from "../assets/moto/400rr.png";
import mx250 from "../assets/moto/250mx.png";

const tabList = [
  {
    Text: "ADV",
    ItemList: [
      {
        ItemTitle: "500X EURO5",
        Img: x500Euro5,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2150×910×1450 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1460 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "820 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "20 л",
              },
              {
                Info: "Нийт жин :",
                Data: "178 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Хос цилиндр, DOHC, Усан хөргүүр,Нэг цилиндрт 4 хавхлага",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "471cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "35KW/8500rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "43N·m/7500rpm",
              },
              {
                Info: "Шахалтын харьцаа :",
                Data: "10.7:1",
              },
              {
                Info: "Араа :",
                Data: "6 араа, гинж хөтлөгчтэй",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "6 сек",
              },
              {
                Info: "Түлшний зарцуулалт :",
                Data: "4.2л/100 км",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "210 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "41мм KYB урвуу сэрээ, Олон тохируулгатай",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Олон тохируулгатай KYB моношоктой хөнгөн цагаан дүүжин гар",
              },
              {
                Info: "Трейл :",
                Data: "106mm",
              },
              {
                Info: "Рэйк :",
                Data: "25.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "NISSIN, 300 мм-ийн хос диск, хос шахуурга, хос калипер, ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "NISSIN, 240мм дан диск, бүлүүр, калипер, ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "Пирелли Метезеллер, 110/80-19",
              },
              {
                Info: "Хойд дугуй :",
                Data: "Пирелли Метезеллер, 150/70-17",
              },
              {
                Info: "Бусад :",
                Data: "Яаралтай тусламжийн гэрэл, USB цэнэглэгчийн порт",
              },
            ],
          },
        ],
      },
      {
        ItemTitle: "500X SINGLE SWING ARM",
        Img: x500singleswingarm,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2150×910×1450 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1460 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "820 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "20 л",
              },
              {
                Info: "Нийт жин :",
                Data: "178 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Хос цилиндр, DOHC, Усан хөргүүр,Нэг цилиндрт 4 хавхлага",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "471cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "35KW/8500rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "43N·m/7500rpm",
              },
              {
                Info: "Шахалтын харьцаа :",
                Data: "10.7:1",
              },
              {
                Info: "Араа :",
                Data: "6 араа, Гинжин хөтлөгч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "6 сек",
              },
              {
                Info: "Түлшний зарцуулалт :",
                Data: "4.2л/100 км",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "210 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "41мм KYB урвуу сэрээ, Олон тохируулгатай",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Олон тохируулгатай KYB моношоктой хөнгөн цагаан дүүжин гар",
              },
              {
                Info: "Трейл :",
                Data: "105mm",
              },
              {
                Info: "Рэйк :",
                Data: "25.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "NISSIN, 300 мм 2 диск, 2 поршений калипер/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "NISSIN, 240 мм-ийн нэг диск, нэг поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "Пирелли Метезеллер, 110/80-19",
              },
              {
                Info: "Хойд дугуй :",
                Data: "Pirelli Metezeller, 150/70-17R",
              },
              {
                Info: "Instrumentation :",
                Data: "LED",
              },
              {
                Info: "Бусад :",
                Data: "Яаралтай тусламжийн гэрэл, USB цэнэглэгчийн порт",
              },
            ],
          },
        ],
      },
      {
        ItemTitle: "510X",
        Img: x500,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2150×910×1450 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1479 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "830 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "20 л",
              },
              {
                Info: "Нийт жин :",
                Data: "178 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Хос цилиндртэй, босоо, DOHC, шингэн хөргөлттэй",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "498 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI (BOSCH)",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "35KW/8500rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "43N·m/6500rpm",
              },
              {
                Info: "Араа :",
                Data: "Гинжин хөтлөгч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "5.1 сек",
              },
              {
                Info: "Түлшний зарцуулалт :",
                Data: "4л/100 км",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "210 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "Дээшээ доошоо чиглүүлж бүрэн тохируулах боломжтой сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Дотоод аюулгүйн дэр",
              },
              {
                Info: "Трейл :",
                Data: "N/A",
              },
              {
                Info: "Рэйк :",
                Data: "25.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "NISSIN, 300 мм 2 диск, 2 поршений калипер/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "NISSIN, 240 мм-ийн нэг диск, нэг поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "Пирелли Метезеллер, 110/80-19",
              },
              {
                Info: "Хойд дугуй :",
                Data: "Pirelli Metezeller, 150/70-17R",
              },
              {
                Info: "Instrumentation :",
                Data: "LED",
              },
              {
                Info: "Бусад :",
                Data: "Яаралтай тусламжийн гэрэл, USB цэнэглэгчийн порт",
              },
            ],
          },
        ],
      },
    ],
  },
  {
    Text: "RETRO",
    ItemList: [
      {
        ItemTitle: "510F",
        Img: f500,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2156×850×1177 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1460±10 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "790 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "20 л",
              },
              {
                Info: "Нийт жин :",
                Data: "191 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Хос цилиндр, DOHC, шингэн хөргөлттэй",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "498 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI (BOSCH)",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "35KW/8500rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "43N·m/6500rpm",
              },
              {
                Info: "Шахалтын харьцаа :",
                Data: "N/A",
              },
              {
                Info: "Араа :",
                Data: "Гинжин хөтлөгч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "5.1 сек",
              },
              {
                Info: "Түлшний зарцуулалт :",
                Data: "4л/100 км",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "180 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "Дээшээ доошоо чиглүүлж бүрэн тохируулах боломжтой сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Дотоод аюулгүйн дэр",
              },
              {
                Info: "Трейл :",
                Data: "35°",
              },
              {
                Info: "Рэйк :",
                Data: "25.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "298mm 2 floating discs , 2-piston calliper/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "240mm single fixed disc, single piston calliper/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "110/80R18",
              },
              {
                Info: "Хойд дугуй :",
                Data: "160/60R17",
              },
              {
                Info: "Гэрэл :",
                Data: "LED",
              },
            ],
          },
        ],
      },
      {
        ItemTitle: "400F SCRAMBLER",
        Img: f400scrambler,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2156×850×1177 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1460 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "790 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "18 л",
              },
              {
                Info: "Нийт жин :",
                Data: "190 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Хос цилиндртэй, OHC, шингэн хөргөлттэй, Нэг цилиндрт 4 хавхлага",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "378 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "28.5KW/9000 rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "35N·m/6500 rpm",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "180 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "Yu An, гидравлик",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Yu An, олон тохируулгатай моношоктой хөнгөн цагаан",
              },
              {
                Info: "Жолооны өнцөг:",
                Data: "35°",
              },
              {
                Info: "Рэйк :",
                Data: "25.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "KAILING, 300 мм-ийн хос диск, хос шахуурга, хос калипер, ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "KAILING, 300 мм 2 диск, 2 поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "110/80-18",
              },
              {
                Info: "Хойд дугуй :",
                Data: "160/60-17",
              },
              {
                Info: "Гэрэл :",
                Data: "LED",
              },
              {
                Info: "Бусад :",
                Data: "Яаралтай тусламжийн гэрэл, USB цэнэглэгчийн порт",
              },
            ],
          },
        ],
      },
      {
        ItemTitle: "321F",
        Img: f321,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2034×743×1120 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1390 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "800 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "13 л",
              },
              {
                Info: "Нийт жин :",
                Data: "153 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Шингэн хөргөлттэй, хос цилиндртэй, DOHC",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "322 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "30.5KW/10500 rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "29N·m/9000 rpm",
              },
              {
                Info: "Шахалтын харьцаа :",
                Data: "11.2:1",
              },
              {
                Info: "Араа :",
                Data: "Олон диск нь газрын тосны ваннд шүүрч авах, 6 араа, гинжин хөтөч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "5.6 сек",
              },
              {
                Info: "Түлшний зарцуулалт :",
                Data: "3.8л/100 км",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "188 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "41 мм Yu An доошоо тохируулж болох сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Yu An тохируулж болох моношок",
              },
              {
                Info: "Трейл :",
                Data: "95 мм",
              },
              {
                Info: "Рэйк :",
                Data: "24.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "320 мм хөвөгч диск, 2 поршений калипер/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "240 мм диск, нэг поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "110/70R17",
              },
              {
                Info: "Хойд дугуй :",
                Data: "150/60R17",
              },
              {
                Info: "Гэрэл :",
                Data: "LED",
              },
            ],
          },
        ],
      },
    ],
  },
  {
    Text: "RALLY",
    ItemList: [
      {
        ItemTitle: "450RALLY REGULAR EDITION (LOW SEAT)",
        Img: rally450low,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2190×805×1390 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1475 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "910 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "15 л",
              },
              {
                Info: "Нийт жин :",
                Data: "145 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Шингэн хөргөлт, тосны хөргөлт, нэг цилиндр, DOHC",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "499 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "38KW/9500rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "40N·m/7000rpm",
              },
              {
                Info: "Араа :",
                Data: "Гинжин хөтлөгч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "180 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "Дээшээ доошоо чиглүүлж бүрэн тохируулах боломжтой сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Дотоод аюулгүйн дэр",
              },
              {
                Info: "Трейл :",
                Data: "35°",
              },
              {
                Info: "Рэйк :",
                Data: "25.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "298mm 2 floating discs , 2-piston calliper/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "240mm single fixed disc, single piston calliper/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "110/80R18",
              },
              {
                Info: "Хойд дугуй :",
                Data: "160/60R17",
              },
              {
                Info: "Гэрэл :",
                Data: "LED",
              },
            ],
          },
        ],
      },
      {
        ItemTitle: "450RALLY FACTORY EDITION",
        Img: rally450,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2170×810×1490 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1490 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "960 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "31 л",
              },
              {
                Info: "Нийт жин ( Түлшгүй ) :",
                Data: "145 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Шингэн хөргөлт, тосны хөргөлт, нэг цилиндр, DOHC",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "499 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "40KW/9500 rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "42N·m/7000rpm",
              },
              {
                Info: "Араа :",
                Data: "Гинжин хөтлөгч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "310 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "Тохируулж болох сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Гадаад агаарын дэр",
              },
              {
                Info: "Жолооны өнцөг:",
                Data: "38.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "Диск, 2 поршений калипер/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "Диск, нэг поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "CST, 90/90 -21",
              },
              {
                Info: "Хойд дугуй :",
                Data: "CST, 140/80-18",
              },
            ],
          },
        ],
      },
    ],
  },
  {
    Text: "NK",
    ItemList: [
      {
        ItemTitle: "321R HIGH SEAT EDITION",
        Img: r310,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "1940×825×1075 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1370 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "820 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "13 л",
              },
              {
                Info: "Нийт жин :",
                Data: "153 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Шингэн хөргөлттэй, хос цилиндр, DOHC",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "322cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "29.5KW/11000rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "29N·m/9000rpm",
              },
              {
                Info: "Шахалтын харьцаа :",
                Data: "11.2:1",
              },
              {
                Info: "Араа :",
                Data: "6 араа, гинжин хөтөч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "5.6 сек",
              },
              {
                Info: "Түлшний зарцуулалт :",
                Data: "4л/100 км",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "175 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "41мм Yu An Тохируулах боломжтой урвуу сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Yu An тохируулж болох моношок",
              },
              {
                Info: "Рэйк :",
                Data: "24°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "320 мм диск, 2 поршений калипер/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "240 мм диск, нэг поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "CST, 110/70R17",
              },
              {
                Info: "Хойд дугуй :",
                Data: "CST, 150/60R17",
              },
              {
                Info: "Гэрэл :",
                Data: "LED",
              },
            ],
          },
        ],
      },
      {
        ItemTitle: "321RR",
        Img: rr321,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "1975×743×1100 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1370 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "800 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "13 л",
              },
              {
                Info: "Нийт жин :",
                Data: "156 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Шингэн хөргөлт, хос цилиндрт, DOHCнэг цилиндрт 4 хавхлагатай",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "322cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "30.5KW/11000rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "29N·m/9000rpm",
              },
              {
                Info: "Шахалтын харьцаа :",
                Data: "12.5:1",
              },
              {
                Info: "Араа :",
                Data: "6 араа, Гинжин хөтлөгч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "6 сек",
              },
              {
                Info: "Түлшний зарцуулалт :",
                Data: "4.2л/100 км",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "135 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "41мм Yu An Тохируулах боломжтой урвуу сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Yu An тохируулж болох моношок",
              },
              {
                Info: "Трейл :",
                Data: "95mm",
              },
              {
                Info: "Рэйк :",
                Data: "24.5°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "320 мм хөвөгч диск, Brembo 2 поршений калипер/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "240 мм диск, Brembo нэг поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "CST, 110/70R17",
              },
              {
                Info: "Хойд дугуй :",
                Data: "CST, 150/60R17",
              },
              {
                Info: "Гэрэл :",
                Data: "LED",
              },
            ],
          },
        ],
      },
      {
        ItemTitle: "400rr",
        Img: rr400,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2015×740×1090 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "960 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "15 л",
              },
              {
                Info: "Нийт жин :",
                Data: "160 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "4 цилиндртэй, босоо, DOHC, шингэн хөргөлттэй",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "399 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI (BOSCH)",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "50KW/13500rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "36N·m/12000rpm",
              },
              {
                Info: "Араа :",
                Data: "Гинжин хөтлөгч",
              },
              {
                Info: "Дээд хурд :",
                Data: "220 км/ц",
              },
              {
                Info: "0-100 км/ц хурд авах хугацаа :",
                Data: "4.2 сек",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "150 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "Дээшээ доошоо чиглүүлж бүрэн тохируулах боломжтой сэрээ",
              },
              {
                Info: "Арын хэсэг :",
                Data: "Дотоод аюулгүйн дэр",
              },
              {
                Info: "Жолооны өнцөг :",
                Data: "28°",
              },
              {
                Info: "Рэйк :",
                Data: "25°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "300мм 2 суурин диск, 2 поршений калипер/ABS",
              },
              {
                Info: "Хойд тормоз :",
                Data: "220 мм-ийн тогтмол диск, нэг поршений калипер/ABS",
              },
              {
                Info: "Урд дугуй :",
                Data: "120/70R17",
              },
              {
                Info: "Хойд дугуй :",
                Data: "160/60R17",
              },
              {
                Info: "Гэрэл :",
                Data: "LED",
              },
            ],
          },
        ],
      },
    ],
  },
  {
    Text: "OFFROAD",
    ItemList: [
      {
        ItemTitle: "MX250 OFFROAD",
        Img: mx250,
        ItemTabList: [
          {
            Text: "Хэмжээ",
            Data: [
              {
                Info: "Урт X Өргөн X Өндөр:",
                Data: "2168×805×1265 мм",
              },
              {
                Info: "Тэнхлэг хоорондын зай :",
                Data: "1490 мм",
              },
              {
                Info: "Суудлын өндөр :",
                Data: "960 мм",
              },
              {
                Info: "Түлшний багтаамж :",
                Data: "6 л",
              },
              {
                Info: "Нийт жин :",
                Data: "98 кг",
              },
            ],
          },
          {
            Text: "Хөдөлгүүр",
            Data: [
              {
                Info: "Хөдөлгүүрийн төрөл :",
                Data: "Нэг цилиндр, 4 хавхлагат, шингэн хөргөлт, DOHC",
              },
              {
                Info: "Хөдөлгүүрийн багтаамж :",
                Data: "249 cc",
              },
              {
                Info: "Ignition method :",
                Data: "EFI",
              },
              {
                Info: "Гаргах дээд хүч :",
                Data: "30KW/11500rpm",
              },
              {
                Info: "Эргэлтийн дээд хүч :",
                Data: "26N·m/9000rpm",
              },
              {
                Info: "Араа :",
                Data: "6 араа, гинжин хөтөч",
              },
              {
                Info: "Дээд хурд :",
                Data: "170 км/ц",
              },
            ],
          },
          {
            Text: "Эд анги",
            Data: [
              {
                Info: "Газар хоорондын зай :",
                Data: "310 мм",
              },
              {
                Info: "Урд хэсэг :",
                Data: "Тохируулах боломжтой сэрээ",
              },
              {
                Info: "Рэйк :",
                Data: "28°",
              },
            ],
          },
          {
            Text: "Тохиргоо",
            Data: [
              {
                Info: "Урд тормоз :",
                Data: "Диск, 2 поршений калипер",
              },
              {
                Info: "Хойд тормоз :",
                Data: "Диск, нэг поршений калипер",
              },
              {
                Info: "Урд дугуй :",
                Data: "80/100 -21",
              },
              {
                Info: "Хойд дугуй :",
                Data: "100/90-19",
              },
              {
                Info: "Амортизатор :",
                Data: "Дээш доош тохируулах боломжтой",
              },
            ],
          },
        ],
      },
    ],
  },
];

export default function Moto() {
  return (
    <>
      <Header />
      <Layout>
        <Flex pt={{ base: "100px", md: "200px" }} w="100%">
          <Flex alignItems="center">
            <Box
              w={{ base: "4px", md: "7px" }}
              h={{ base: "45px", md: "75px" }}
              marginRight="30px"
              bg="#d82424"
            />
            {/* <AnimationOnScroll animateIn="animate__fadeInDown"> */}
            <Text
              fontWeight="bold"
              fontSize={{ base: "35px", md: "60px" }}
              letterSpacing="1.58px"
              color="#ffffff"
              fontFamily="Oswald"
            >
              МОТОЦИКЛ
            </Text>
            {/* </AnimationOnScroll> */}
          </Flex>
        </Flex>
        <Tabs py="100px" align="center" position="relative" variant="unstyled">
          <Box overflow="auto">
            <TabList w="max-content" fontFamily="Oswald">
              {tabList.map((item, index) => (
                <Tab
                  key={index}
                  _selected={{ color: "#ffffff" }}
                  letterSpacing="1.25px"
                  fontWeight="bold"
                  fontSize={{ base: "25px", md: "50px" }}
                >
                  {item.Text}
                </Tab>
              ))}
            </TabList>
          </Box>
          <TabIndicator
            mt="-1.5px"
            height="5px"
            bg="#ffffff"
            borderRadius="1px"
          />
          <TabPanels>
            {tabList?.map((item) => (
              <TabPanel>
                {item?.ItemList?.map((item) => (
                  <ProdTabInfo data={item} />
                ))}
              </TabPanel>
            ))}
          </TabPanels>
        </Tabs>
      </Layout>
      <Footer />
    </>
  );
}
